1s/ERP/Conf/Enums/СтатусыОбработкиФормированиеПартийЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиФормированиеПартийЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартияСформирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартияАннулирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииСформированыЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыОбработкиФормированиеПартийЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Массив статусов, в которых проведенный документ требует резервирования исходной партии.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыОбработкиФормированиеПартийЗЕРНО -- Требует резервирования партии
Функция ТребуетРезервированияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Черновик);
	Результат.Добавить(ФормированиеПартииКПередаче);
	Результат.Добавить(ФормированиеПартииОбрабатывается);
	Результат.Добавить(ФормированиеПартииОшибкаПередачи);
	Возврат Результат;
	
КонецФункции

// Массив статусов, в которых проведенный документ требует списания исходной партии.
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.СтатусыОбработкиФормированиеПартийЗЕРНО - Требует списания партии
Функция ТребуетСписанияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартияСформирована);
	Результат.Добавить(ПартииСформированыЧастично);
	Результат.Добавить(АннулированиеПартииКПередаче);
	Результат.Добавить(АннулированиеПартииОбрабатывается);
	Результат.Добавить(АннулированиеПартииОшибкаПередачи);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
